{"/docs/getting-started/":{"data":{"":" "},"title":"Getting Started"},"/our_lab/":{"data":{"":"","#":"Members 2024 Grade Name Research Theme Professor Kenji Ono HPC, CFD, Vis., Equation Discovery D3 Satoshi Ito Genome Analysis Akito Fujii Visualization Likun Liu Visualization D2 Naoyuki Sogo HPC Ji Qi CFD, Wind turbine D1 M2 Takumi Hagiwara Molecular Dynamics for DNA Kousuke Ureshino … M1 Kanae Shiragami Equation Discovery B4 Shun Shimodouzono Equation Discovery Kouhei Torii ? Takahiro Iwasaki ? Stuff Name Job Title Duration of Employment Mikio Iizuka Professor 2016-2019 Daisuke Sakurai Associate Professor 2019-2024 Sueko Ando Secretary 2016-2020 Alumni Graduate Year Name Theme 2021 Master Taiki Etoh 2020 Bachelor Akito Fujii 2020 Bachelor Akinori Miura 2020 Bachelor Taiga Yamamoto 2020 Master Issei Koga Research on estimating governing equations from observational data 2019 Bachelor Hiroki Wada Research on generating high-fidelity images from sparse data 2019 Bachelor Ryotaro Maita Proposal for an intermediate representation and conversion method to shader code for 3D object generation procedures consisting solely of distance function models 2018 Bachelor Yuuto Minami 2017 Bachelor Kazuto Ichimaru Research on the effectiveness of rehabilitation using virtual reality and its impact on both the mind and body "},"title":"Our Laboratory"},"/project/tdw/":{"data":{"chowder#ChOWDER":"ChOWDER The original image is obtained from https://noirlab.edu/public/images/noirlab2406a/"},"title":"Tiled-Display Wall"},"/publication/2018/":{"data":{"":"","#":"ChOWDER: An Adaptive Tiled Display Wall Driver for Dynamic Remote Collaboration Kawanabe T., Nonaka J., Hatta K., Ono K., _ In: Luo Y. (eds) Cooperative Design, Visualization, and Engineering. CDVE 2018. Lecture Notes in Computer Science_, vol 11151, 2018, Springer, Cham. https://doi.org/10.1007/978-3-030-00560-3_2\nHigh-Performance Parallel Simulation of Airflow for Complex Terrain Surface Kenji Ono and Takanori Uchida, Modelling and Simulation in Engineering, vol. 2019, Article ID 5231839, 10 pages, 2019. https://doi.org/10.1155/2019/5231839\nDesign of a Flexible In Situ Framework with a Temporal Buffer for Data Processing and Visualization of Time-Varying Datasets Ono K., Nonaka J., Yoshikawa H., Nanri T., Morie Y., Kawanabe T., and Shoji F., Lecture Notes in Computer Science, 11203, 243-257, 2018. https://doi.org/10.1007/978-3-030-02465-9_17"},"title":"2018"},"/publication/2022/":{"data":{"":"","#":"A Scalable Parallel Partition Tridiagonal Solver for Many-Core and Low B/F Processors T. Mitsuda and K. Ono, 2022 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW), Lyon, France, 2022, pp. 860-869, https://doi.org/10.1109/IPDPSW55747.2022.00142\nEfficient compressed database of equilibrated configurations of ring-linear polymer blends for MD simulations Hagita, K., Murashima, T., Ogino, M., Omiya, M., Ono, K., Deguchi, T., Jinnai, H., and Kawakatsu, T., Scientific Data, 9(40), 2022, https://doi.org/10.1038/s41597-022-01138-3"},"title":"2022"},"/publication/2023/":{"data":{"":"","#":"Error-bounded Scalable Parallel Tensor Train Decomposition S. Xie, A. Miura and K. Ono, 2023 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW), St. Petersburg, FL, USA, 2023, pp. 345-353, https://doi.org/10.1109/IPDPSW59300.2023.00064\nAcceleration of BAM I/O on distributed file systems S. Ito, S. Miyano and K. Ono, 2023 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), Istanbul, Turkiye, 2023, pp. 3299-3304, https://doi.org/10.1109/BIBM58861.2023.10385370\nMixing Data Augmentation with Preserving Foreground Regions in Medical Image Segmentation X. Liu, K. Ono and R. Bise, 2023 IEEE 20th International Symposium on Biomedical Imaging (ISBI), Cartagena, Colombia, 2023, pp. 1-5, https://doi.org/10.1109/ISBI53787.2023.10230495\nToward Feature-Preserving Vector Field Compression Liang, X., Di, S., Cappello, F., Raj, M., Liu, C., Ono, K., Chen, Z., Peterka, T., and Guo, H., in IEEE Transactions on Visualization and Computer Graphics, vol. 29, no. 12, pp. 5434-5450, Dec. 2023, https://doi.org/10.1109/TVCG.2022.3214821"},"title":"2023"},"/publication/2024/":{"data":{"":"","#":"Large-scaleWGS Analysis on the supercomputer Fugaku Satoshi Ito, Kenji Ono, and Satoru Miyano. 2024. In Proceedings of the 2024 14th International Conference on Bioscience, Biochemistry and Bioinformatics (ICBBB ‘24). Association for Computing Machinery, New York, NY, USA, 14–20. https://doi.org/10.1145/3640900.3640903"},"title":"2024"},"/teaching/":{"data":{"":"","#":"2019 高性能並列計算法特論 オートモーティブ人間科学概論 数値解析 数値解析演習 2018 高性能並列計算法特論 数値解析 数値解析演習 並列アルゴリズム 数値熱流体工学 2017 高性能並列計算法特論 数値解析 数値解析演習 並列アルゴリズム 数値熱流体工学 日産技術講座「流体力学」 2016 高性能並列計算法特論 数値解析 数値解析演習 並列アルゴリズム 数値熱流体工学 2015 高性能並列計算法特論 数値熱流体工学 "},"title":"Teaching"}}