{"/ja/link/":{"data":{"":"","#":"情報基盤研究開発センター 汎オミクス計測･計算科学センター 洋上風力研究教育センター システム情報科学府 情報理工学専攻 "},"title":"リンク"},"/ja/our_lab/":{"data":{"":"","#":"メンバー 2024 学年 氏名 研究テーマ 教授 小野 謙二 高性能計算、数値流体力学、可視化、方程式発見 D3 伊東 聰 ゲノム分析の高速化 藤井 彬人 Reeb空間を用いた可視化 劉 立坤 可視化 D2 十川 直幸 疎行列に対する最適解法の自動選択 斉 済 数値流体力学によるウインドファームの性能予測 D1 M2 萩原 拓海 DNAの分子動力学 嬉野 公亮 … M1 白神 叶衣 方程式発見 B4 下堂薗 駿 方程式発見 鳥井 公平 データ分析と可視化 岩崎 崇紘 太陽熱エネルギーの長期蓄熱利用 スタッフ 氏名 役職 雇用期間 飯塚 幹夫 特任教授 2016-2019 櫻井 大督 准教授 2019-2024 肖 健 客員研究員 (天津大学) 2017-2018 安藤 末子 秘書 2016-2020 卒業生 学部 卒業年 氏名 論文 2024 白神 叶衣 2024 藤嶋 拓翔 2023 武末 輝大 2023 萩原 拓海 2022 寺崎 楓 2022 嬉野 公亮 2021 五味 琢朗 2020 藤井 彬人 2020 三浦 尭徳 2020 山元 大賀 2019 和田 裕己 Research on generating high-fidelity images from sparse data 2019 南 優斗 2018 衛藤 大甲 2018 舞田 涼太朗 Proposal for an intermediate representation and conversion method to shader code for 3D object generation procedures consisting solely of distance function models 2017 市丸 和人 Research on the effectiveness of rehabilitation using virtual reality and its impact on both the mind and body 2017 古賀 壱成 修士 卒業年 氏名 論文 2024 寺﨑 楓 2023 斉 済 2023 謝 施遥 2022 光田 達哉 2022 藤井 彬人 2022 山元 大賀 2022 TIAN YE 2022 三浦 尭徳 2022 劉 暁慶 2020 衛藤 大甲 2019 古賀 壱成 Research on estimating governing equations from observational data 博士 卒業年 氏名 論文 研究室所在地 情報基盤研究開発センター 511室"},"title":"小野研究室について"},"/ja/project/":{"data":{"":"当研究室で実施している研究プロジェクトを紹介します。"},"title":"プロジェクト"},"/ja/project/tdw/":{"data":{"chowder#ChOWDER":"ChOWDER The original image is obtained from https://noirlab.edu/public/images/noirlab2406a/"},"title":"タイルドディスプレイウォール"},"/ja/publication/":{"data":{"":"","#":"2024 Large-scaleWGS Analysis on the supercomputer Fugaku\nSatoshi Ito, Kenji Ono, and Satoru Miyano. 2024. In Proceedings of the 2024 14th International Conference on Bioscience, Biochemistry and Bioinformatics (ICBBB ‘24). Association for Computing Machinery, New York, NY, USA, 14–20. https://doi.org/10.1145/3640900.3640903 2023 Error-bounded Scalable Parallel Tensor Train Decomposition\nS. Xie, A. Miura and K. Ono, 2023 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW), St. Petersburg, FL, USA, 2023, pp. 345-353, https://doi.org/10.1109/IPDPSW59300.2023.00064\nAcceleration of BAM I/O on distributed file systems\nS. Ito, S. Miyano and K. Ono, 2023 IEEE International Conference on Bioinformatics and Biomedicine (BIBM), Istanbul, Turkiye, 2023, pp. 3299-3304, https://doi.org/10.1109/BIBM58861.2023.10385370\nMixing Data Augmentation with Preserving Foreground Regions in Medical Image Segmentation\nX. Liu, K. Ono and R. Bise, 2023 IEEE 20th International Symposium on Biomedical Imaging (ISBI), Cartagena, Colombia, 2023, pp. 1-5, https://doi.org/10.1109/ISBI53787.2023.10230495\nToward Feature-Preserving Vector Field Compression\nLiang, X., Di, S., Cappello, F., Raj, M., Liu, C., Ono, K., Chen, Z., Peterka, T., and Guo, H., in IEEE Transactions on Visualization and Computer Graphics, vol. 29, no. 12, pp. 5434-5450, Dec. 2023, https://doi.org/10.1109/TVCG.2022.3214821\n2022 A Scalable Parallel Partition Tridiagonal Solver for Many-Core and Low B/F Processors\nT. Mitsuda and K. Ono, 2022 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW), Lyon, France, 2022, pp. 860-869, https://doi.org/10.1109/IPDPSW55747.2022.00142\nEfficient compressed database of equilibrated configurations of ring-linear polymer blends for MD simulations\nHagita, K., Murashima, T., Ogino, M., Omiya, M., Ono, K., Deguchi, T., Jinnai, H., and Kawakatsu, T., Scientific Data, 9(40), 2022, https://doi.org/10.1038/s41597-022-01138-3\n2021 2020 2019 2018 ChOWDER: An Adaptive Tiled Display Wall Driver for Dynamic Remote Collaboration\nKawanabe T., Nonaka J., Hatta K., Ono K., _ In: Luo Y. (eds) Cooperative Design, Visualization, and Engineering. CDVE 2018. Lecture Notes in Computer Science_, vol 11151, 2018, Springer, Cham. https://doi.org/10.1007/978-3-030-00560-3_2\nHigh-Performance Parallel Simulation of Airflow for Complex Terrain Surface\nKenji Ono and Takanori Uchida, Modelling and Simulation in Engineering, vol. 2019, Article ID 5231839, 10 pages, 2019. https://doi.org/10.1155/2019/5231839\nDesign of a Flexible In Situ Framework with a Temporal Buffer for Data Processing and Visualization of Time-Varying Datasets\nOno K., Nonaka J., Yoshikawa H., Nanri T., Morie Y., Kawanabe T., and Shoji F., Lecture Notes in Computer Science, 11203, 243-257, 2018. https://doi.org/10.1007/978-3-030-02465-9_17"},"title":"論文リスト"},"/ja/research/":{"data":{"":"当研究室で扱っている研究について紹介します。"},"title":"研究"},"/ja/research/cfd/":{"data":{"":"","cartesian-based-parallel-cfd-application#Cartesian based Parallel CFD Application":"Cartesian based Parallel CFD Application "},"title":"数値流体力学"},"/ja/research/genetic_algorithm/":{"data":{"":"","genetic-programming#Genetic Programming":"Genetic Programming "},"title":"遺伝的アルゴリズム"},"/ja/research/hpc/":{"data":{"":"","gpu計算#GPU計算":"","大規模疎行列の高性能反復計算法#大規模疎行列の高性能反復計算法":"流体計算の圧力ポアソン方程式から導出される連立一次方程式 $A\\bm{x}=\\bm{b}$ の係数行列 $A$ は大規模疎行列となる。近年の高い演算性能ではあるが低Byte/Flop(B/F)アーキテクチャにおいては、行列ベクトル積のナイーブな実装はB/F値 ${}^1$ が高くなるため、低B/F計算機の性能を引き出すことができない。そこで、連立一次方程式の解法として高い演算性能とスケーラビリティを達成できる直接法と反復法のハイブリッド解法SLOR-PCR法を提案した。 提案方法は、シンプルなSOR法を基本反復法とし、多重ループの最内側の三重対角行列の反転に効率的なLU分解を組み合わせる。このとき、LU分解だけではB/F値が高くなるため、Parallel Cyclic Reduction (PCR)を併用し、演算密度とスケーラビリティを向上させた。\nメモリから演算ユニットまでのデータの移動量 (Byte) と演算ユニットでの浮動小数点演算数の比。計算アルゴリズムやハードウェアの特性を表す指標の一つ。 図　SLOR-PCR法とJacobi, SOR法との性能比較","性能モニタリング#性能モニタリング":"アプリケーションの実行性能をモニタリングするため、演算部と通信部の時間コストを記録、統計処理した情報を提供するライブラリを開発した。","時間並列計算#時間並列計算":""},"title":"高性能計算"},"/ja/research/ttd/":{"data":{"":"","scalable-tensor-train-decomposition#Scalable Tensor-Train Decomposition":"Scalable Tensor-Train Decomposition "},"title":"テンソルトレイン分解"},"/ja/research/visualization/":{"data":{"":"","in-situ-visualization#In-Situ Visualization":"","tiled-display-wall#Tiled-Display Wall":"","visualization-system-for-cfd#Visualization System for CFD":"V-Isio","visualization-system-for-large-scale-paralle-computing#Visualization System for Large-Scale Paralle Computing":""},"title":"可視化"},"/ja/research/workflow/":{"data":{"":"","wheelシステム#WHEELシステム":"WHEELシステム "},"title":"ワークフロー"},"/ja/software/":{"data":{"":"","cutlib#Cutlib":"研究と関連する開発ソフトウェアです。\nFFV-C PMlib Text Parser Polylib Cutlib ","ffv-c#FFV-C":"","pmlib#PMlib":"","polylib#Polylib":"","text-parser#Text Parser":""},"title":"Software"},"/ja/teaching/":{"data":{"":"","#":"2024 計算機シミュレーション特論 オートモーティブ人間科学概論 数値解析 数値解析演習 情報科学講究 数学共創概論Ⅰ 2023 計算機シミュレーション特論 オートモーティブ人間科学概論 数値解析 数値解析演習 情報科学講究 数学共創概論Ⅰ 数値熱流体工学(東京大学) 2022 計算機シミュレーション特論 オートモーティブ人間科学概論 数値解析 数値解析演習 情報科学講究 数学共創概論Ⅰ 数値熱流体工学(東京大学) 2021 高性能並列計算法特論 オートモーティブ人間科学概論 数値解析 数値解析演習 情報科学講究 並列アルゴリズム 数学共創概論Ⅰ 数値熱流体工学(東京大学) 2020 高性能並列計算法特論 オートモーティブ人間科学概論 数値解析 数値解析演習 並列アルゴリズム 情報科学講究 数値熱流体工学(東京大学) 2019 高性能並列計算法特論 オートモーティブ人間科学概論 数値解析 数値解析演習 並列アルゴリズム 情報科学講究 数値熱流体工学(東京大学) 2018 高性能並列計算法特論 数値解析 数値解析演習 並列アルゴリズム 情報科学講究 数値熱流体工学(東京大学) 2017 高性能並列計算法特論 数値解析 数値解析演習 並列アルゴリズム 情報科学講究 数値熱流体工学(東京大学) 日産技術講座「流体力学」 2016 高性能並列計算法特論 数値解析 数値解析演習 並列アルゴリズム 情報科学講究 数値熱流体工学(東京大学) 2015 高性能並列計算法特論 数値熱流体工学(東京大学) "},"title":"講義"}}